app/controllers/organizations_controller.rb

SELECT * FROM "organizations" WHERE ("organizations"."id" = 33)
---
  def edit
    @organization = Organization.find(params[:id])

INSERT INTO "organizations" ("name", "goal", "created_at", "updated_at", "vision", "description", "organization_id") VALUES('Sucursal54', '', '2010-05-28 13:40:38', '2010-05-28 13:40:38', '', '', 33)
---
  def create
    @organization = Organization.new(params[:organization])

    respond_to do |format|
      if @organization.save

SELECT * FROM "organizations" WHERE ("organizations"."id" = 49)
UPDATE "organizations" SET "updated_at" = '2010-05-28 19:05:13', "name" = 'ter' WHERE "id" = 49
---
  def update
    @organization = Organization.find(params[:id])

    respond_to do |format|
      if @organization.update_attributes(params[:organization])

SELECT * FROM "organizations" WHERE ("organizations"."id" = 57)
DELETE FROM "organizations" WHERE "id" = 57
---
  def destroy
    @organization = Organization.find(params[:id])
    @organization.destroy