app/controllers/presentation_controller.rb

SELECT * FROM "organizations" WHERE ("organizations".organization_id = 1)
SELECT * FROM "organizations" ORDER BY id
SELECT * FROM "strategies" WHERE ("strategies".organization_id = 48)
---
  def org_and_strat

    return_data=[]
    if params[:node].match(/src:root/)
      data=Organization.find_all_by_organization_id(0)
      return_data=join_nodes_orgs(data)
    elsif params[:node].match(/src:orgs/)
      id=params[:node].sub(/src:orgs/,"").to_i
      data=Organization.find_all_by_organization_id(id)
      if data.empty?
        data=Strategy.find_all_by_organization_id(id)