app/controllers/presentation_controller.rb

  def org_and_strat

    @organizations=Organization.find_all_by_organization_id(0)

    @nodes=[]
    unless params[:organization_id].to_i==0
      @organization=Organization.find(params[:organization_id])
---
SELECT * FROM "organizations" WHERE ("organizations"."id" = 0)